waveshareteam/ESP32-S3-Touch-AMOLED-2.16/examples/arduino/libraries/SensorLib/src/bosch/bhy2_defs.h
/*! Helper macros */
#define BHY2_CHK_BIT(data, bit)                   (((uint32_t)data >> bit) & 0x01)
#define BHY2_ROUND_WORD_LOWER(x)                  ((x >> 2) << 2)
#define BHY2_ROUND_WORD_HIGHER(x)                 (((x >> 2) + 1) << 2)

#define BHY2_COUNTOF(__BUFFER__)                  (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)))
#define BHY2_DATA_INJECT_MODE_PAYLOAD_LEN         UINT8_C(0x04)

/*! Firmware header identifier */
#define BHY2_FW_MAGIC                             UINT16_C(0x662B)

/*! BHy260 Variant IDs */
#define BHY2_VARIANT_ID_BHA260AB                  UINT32_C(0x2838C2C2)
#define BHY2_VARIANT_ID_BHI260AB                  UINT32_C(0x266EB6E7)
#define BHY2_VARIANT_ID_BHI260AP                  UINT32_C(0x98D7A5D1)

/*! Boot status */
#define BHY2_BST_FLASH_DETECTED                   UINT8_C(0x01)
#define BHY2_BST_FLASH_VERIFY_DONE                UINT8_C(0x02)
#define BHY2_BST_FLASH_VERIFY_ERROR               UINT8_C(0x04)
#define BHY2_BST_NO_FLASH                         UINT8_C(0x08)
#define BHY2_BST_HOST_INTERFACE_READY             UINT8_C(0x10)
#define BHY2_BST_HOST_FW_VERIFY_DONE              UINT8_C(0x20)
#define BHY2_BST_HOST_FW_VERIFY_ERROR             UINT8_C(0x40)
#define BHY2_BST_HOST_FW_IDLE                     UINT8_C(0x80)
#define BHY2_BST_CHECK_RETRY                      UINT8_C(100)

/*! Host status */
#define BHY2_HST_POWER_STATE                      UINT8_C(0x01)
#define BHY2_HST_HOST_PROTOCOL                    UINT8_C(0x02)
#define BHY2_HST_HOST_CHANNEL_0                   UINT8_C(0x10)
#define BHY2_HST_HOST_CHANNEL_1                   UINT8_C(0x20)
#define BHY2_HST_HOST_CHANNEL_2                   UINT8_C(0x40)
#define BHY2_HST_HOST_CHANNEL_3                   UINT8_C(0x80)

/*! Interrupt status masks */
#define BHY2_IST_MASK_ASSERTED                    (0x1)
#define BHY2_IST_MASK_FIFO_W                      (0x6)
#define BHY2_IST_MASK_FIFO_NW                     (0x18)
#define BHY2_IST_MASK_STATUS                      (0x20)
#define BHY2_IST_MASK_DEBUG                       (0x40)
#define BHY2_IST_MASK_RESET_FAULT                 (0x80)
#define BHY2_IST_FIFO_W_DRDY                      UINT8_C(0x2)
#define BHY2_IST_FIFO_W_LTCY                      UINT8_C(0x4)
#define BHY2_IST_FIFO_W_WM                        UINT8_C(0x6)
#define BHY2_IST_FIFO_NW_DRDY                     UINT8_C(0x8)
#define BHY2_IST_FIFO_NW_LTCY                     UINT8_C(0x10)
#define BHY2_IST_FIFO_NW_WM                       UINT8_C(0x18)
#define BHY2_IS_INT_FIFO_W(status)                (status & BHY2_IST_MASK_FIFO_W)
#define BHY2_IS_INT_FIFO_NW(status)               (status & BHY2_IST_MASK_FIFO_NW)
#define BHY2_IS_INT_STATUS(status)                (status & BHY2_IST_MASK_STATUS)
#define BHY2_IS_INT_ASYNC_STATUS(status)          (status & BHY2_IST_MASK_DEBUG)
#define BHY2_IS_INT_RESET(status)                 (status & BHY2_IST_MASK_RESET_FAULT)
#define BHY2_IST_MASK_FIFO                        (BHY2_IST_MASK_FIFO_W | BHY2_IST_MASK_FIFO_NW)
#define BHY2_IS_INT_FIFO(status)                  (status & BHY2_IST_MASK_FIFO)

/*! Chip control bits */
#define BHY2_CHIP_CTRL_DISABLE                    UINT8_C(0x00)
#define BHY2_CHIP_CTRL_TURBO_ENABLE               UINT8_C(0x01)
#define BHY2_CHIP_CTRL_CLR_ERR_REG                UINT8_C(0x02)

/*! Host interface control bits */
#define BHY2_HIF_CTRL_ABORT_TRANSFER_CHANNEL_0    UINT8_C(0x01)
#define BHY2_HIF_CTRL_ABORT_TRANSFER_CHANNEL_1    UINT8_C(0x02)
#define BHY2_HIF_CTRL_ABORT_TRANSFER_CHANNEL_2    UINT8_C(0x04)
#define BHY2_HIF_CTRL_ABORT_TRANSFER_CHANNEL_3    UINT8_C(0x08)
#define BHY2_HIF_CTRL_AP_SUSPENDED                UINT8_C(0x10)
#define BHY2_HIF_CTRL_TIMESTAMP_EV_CTRL           UINT8_C(0x40)
#define BHY2_HIF_CTRL_ASYNC_STATUS_CHANNEL        UINT8_C(0x80)

/*! Interrupt control bits */
#define BHY2_ICTL_DISABLE_FIFO_W                  UINT8_C(0x01)
#define BHY2_ICTL_DISABLE_FIFO_NW                 UINT8_C(0x02)
#define BHY2_ICTL_DISABLE_STATUS_FIFO             UINT8_C(0x04)
#define BHY2_ICTL_DISABLE_DEBUG                   UINT8_C(0x08)
#define BHY2_ICTL_DISABLE_FAULT                   UINT8_C(0x10)
#define BHY2_ICTL_ACTIVE_LOW                      UINT8_C(0x20)
#define BHY2_ICTL_EDGE                            UINT8_C(0x40)
#define BHY2_ICTL_OPEN_DRAIN                      UINT8_C(0x80)

/*! Reset command */
#define BHY2_REQUEST_RESET                        UINT8_C(0x01)

/*! FIFO Format bit */
#define BHY2_FIFO_FORMAT_CTRL_MASK                UINT8_C(0x03)
#define BHY2_FIFO_FORMAT_CTRL_DIS_DELTA_TS        UINT8_C(0x01)
#define BHY2_FIFO_FORMAT_CTRL_DIS_FULL_TS         UINT8_C(0x02)
#define BHY2_FIFO_FORMAT_CTRL_DIS_ALL_TS          UINT8_C(0x03)

/*! System parameters */
#define BHY2_PARAM_READ_MASK                      UINT16_C(0x1000)
#define BHY2_PARAM_FIFO_CTRL                      UINT16_C(0x103)
#define BHY2_PARAM_SYS_VIRT_SENSOR_PRESENT        UINT16_C(0x11F)
#define BHY2_PARAM_SYS_PHYS_SENSOR_PRESENT        UINT16_C(0x120)
#define BHY2_PARAM_PHYSICAL_SENSOR_BASE           UINT16_C(0x120)
#define BHY2_PARAM_BSX_CALIB_STATE_BASE           UINT16_C(0x200)
#define BHY2_PARAM_BSX_CALIB_STATE_ACCEL          UINT16_C(0x201)
#define BHY2_PARAM_BSX_CALIB_STATE_GYRO           UINT16_C(0x203)
#define BHY2_PARAM_BSX_CALIB_STATE_MAG            UINT16_C(0x205)
#define BHY2_PARAM_BSX_SIC                        UINT16_C(0x27D)
#define BHY2_PARAM_BSX_VERSION                    UINT16_C(0x27E)
#define BHY2_PARAM_SET_SENSOR_CTRL                UINT16_C(0x0E00)
#define BHY2_PARAM_GET_SENSOR_CTRL                UINT16_C(0x1E00)
#define BHY2_PARAM_SENSOR_CTRL_FOC                UINT8_C(0x1)
#define BHY2_PARAM_SENSOR_CTRL_OIS                UINT8_C(0x2)
#define BHY2_PARAM_SENSOR_CTRL_FST                UINT8_C(0x3)
#define BHY2_PARAM_SENSOR_CTRL_READ               UINT8_C(0x80)
#define BHY2_PARAM_SENSOR_INFO_0                  UINT16_C(0x300)
#define BHY2_PARAM_SENSOR_CONF_0                  UINT16_C(0x500)

#define BHY2_BSX_STATE_TRANSFER_COMPLETE          UINT8_C(0x80)
#define BHY2_BSX_STATE_BLOCK_NUM_MSK              UINT8_C(0x7F)
#define BHY2_BSX_STATE_BLOCK_LEN                  UINT8_C(64)
#define BHY2_BSX_STATE_STRUCT_LEN                 UINT8_C(68)

