waveshareteam/ESP32-S3-Touch-AMOLED-2.16/examples/arduino/libraries/SensorLib/src/bosch/bhy2_defs.h
/*! Activity bits */
#define BHY2_STILL_ACTIVITY_ENDED                 (0x0001)
#define BHY2_WALKING_ACTIVITY_ENDED               (0x0002)
#define BHY2_RUNNING_ACTIVITY_ENDED               (0x0004)
#define BHY2_ON_BICYCLE_ACTIVITY_ENDED            (0x0008)
#define BHY2_IN_VEHICLE_ACTIVITY_ENDED            (0x0010)
#define BHY2_TILTING_ACTIVITY_ENDED               (0x0020)

#define BHY2_STILL_ACTIVITY_STARTED               (0x0100)
#define BHY2_WALKING_ACTIVITY_STARTED             (0x0200)
#define BHY2_RUNNING_ACTIVITY_STARTED             (0x0400)
#define BHY2_ON_BICYCLE_ACTIVITY_STARTED          (0x0800)
#define BHY2_IN_VEHICLE_ACTIVITY_STARTED          (0x1000)
#define BHY2_TILTING_ACTIVITY_STARTED             (0x2000)

/*! Custom firmware gpio control command*/
#define BHY2_INPUT                 (0x0)
#define BHY2_OUTPUT                (0x1)
#define BHY2_INPUT_PULLUP          (0x2)
#define BHY2_OPEN_DRAIN            (0x3)
#define BHY2_GPIO_SET              (0x80)

/*! Feature status */
#define BHY2_FEAT_STATUS_FLASH_DESC_MSK           UINT8_C(0x01)
#define BHY2_FEAT_STATUS_OPEN_RTOS_MSK            UINT8_C(0x02)
#define BHY2_FEAT_STATUS_OPEN_RTOS_POS            (1)
#define BHY2_FEAT_STATUS_HOST_ID_MSK              UINT8_C(0x1C)
#define BHY2_FEAT_STATUS_HOST_ID_POS              (2)
#define BHY2_FEAT_STATUS_ALGO_ID_MSK              UINT8_C(0xE0)
#define BHY2_FEAT_STATUS_ALGO_ID_POS              (5)

/*! Fast offset compensation status codes */
#define BHY2_FOC_PASS                             UINT8_C(0x00)
#define BHY2_FOC_FAILED                           UINT8_C(0x65)
#define BHY2_FOC_UNKNOWN_FAILURE                  UINT8_C(0x23)

/*! Self test status codes */
#define BHY2_ST_PASSED                            UINT8_C(0x00)
#define BHY2_ST_X_AXIS_FAILED                     UINT8_C(0x01)
#define BHY2_ST_Y_AXIS_FAILED                     UINT8_C(0x02)
#define BHY2_ST_Z_AXIS_FAILED                     UINT8_C(0x04)
#define BHY2_ST_MULTI_AXIS_FAILURE                UINT8_C(0x07)
#define BHY2_ST_NOT_SUPPORTED                     UINT8_C(0x08)
#define BHY2_ST_INVALID_PHYS_ID                   UINT8_C(0x09)

#define BHY2_LE2U16(x)                            ((uint16_t)((x)[0] | (x)[1] << 8))
#define BHY2_LE2S16(x)                            ((int16_t)BHY2_LE2U16(x))
#define BHY2_LE2U24(x)                            ((uint32_t)((x)[0] | (uint32_t)(x)[1] << 8 | (uint32_t)(x)[2] << 16))
#define BHY2_LE2S24(x)                            ((int32_t)(BHY2_LE2U24(x) << 8) >> 8)
#define BHY2_LE2U32(x)                            ((uint32_t)((x)[0] | (uint32_t)(x)[1] << 8 | (uint32_t)(x)[2] << 16 | \
                                                              (uint32_t)(x)[3] << 24))
#define BHY2_LE2S32(x)                            ((int32_t)BHY2_LE2U32(x))
#define BHY2_LE2U40(x)                            (BHY2_LE2U32(x) | (uint64_t)(x)[4] << 32)
#define BHY2_LE2U64(x)                            (BHY2_LE2U32(x) | (uint64_t)BHY2_LE2U32(&(x)[4]) << 32)

#define BHY2_LE24MUL(x)                           (((x) % 4) ? (uint16_t)((((x) / 4) + 1) * 4) : (uint16_t)((x) + 4))

/*! Maximum no of available virtual sensor */
#define BHY2_N_VIRTUAL_SENSOR_MAX                 UINT8_C(256)

#ifndef BHY2_MAX_SIMUL_SENSORS
#define BHY2_MAX_SIMUL_SENSORS                    48
#endif

/* Special & debug virtual sensor id starts at 245 */
#define BHY2_SPECIAL_SENSOR_ID_OFFSET             UINT8_C(245)

#ifndef BHY2_INTF_RET_TYPE
#define BHY2_INTF_RET_TYPE                        int8_t
#endif

#ifndef BHY2_INTF_RET_SUCCESS
#define BHY2_INTF_RET_SUCCESS                     0
#endif

/* Type definitions for the function pointers */
typedef BHY2_INTF_RET_TYPE (*bhy2_read_fptr_t)(uint8_t reg_addr, uint8_t *reg_data, uint32_t length, void *intf_ptr);
typedef BHY2_INTF_RET_TYPE (*bhy2_write_fptr_t)(uint8_t reg_addr, const uint8_t *reg_data, uint32_t length,
        void *intf_ptr);
typedef void (*bhy2_delay_us_fptr_t)(uint32_t period_us, void *intf_ptr);
typedef void (*bhy2_progress_callback)(void *user_data, uint32_t total, uint32_t transferred);

enum bhy2_intf {
    BHY2_SPI_INTERFACE = 1,
    BHY2_I2C_INTERFACE
};

/* HIF device structure */
struct bhy2_hif_dev {
    bhy2_read_fptr_t read;
    bhy2_write_fptr_t write;
    bhy2_delay_us_fptr_t delay_us;
    enum bhy2_intf intf;
    void *intf_ptr;
    BHY2_INTF_RET_TYPE intf_rslt;
    uint32_t read_write_len;
};

enum bhy2_fifo_type {
    BHY2_FIFO_TYPE_WAKEUP,
    BHY2_FIFO_TYPE_NON_WAKEUP,
    BHY2_FIFO_TYPE_STATUS,
    BHY2_FIFO_TYPE_MAX
};

struct BHY2_PACKED bhy2_fifo_parse_data_info {
    uint8_t sensor_id;
    enum bhy2_fifo_type fifo_type;
    uint8_t data_size;
    uint8_t *data_ptr;
    uint64_t *time_stamp;
};

typedef void (*bhy2_fifo_parse_callback_t)(const struct bhy2_fifo_parse_data_info *callback_info, void *private_data);

struct BHY2_PACKED bhy2_fifo_parse_callback_table {
    uint8_t sensor_id;
    bhy2_fifo_parse_callback_t callback;
    void *callback_ref;
};

/* Device structure */
struct bhy2_dev {
    struct bhy2_hif_dev hif;
    struct bhy2_fifo_parse_callback_table table[BHY2_MAX_SIMUL_SENSORS];
    uint8_t event_size[BHY2_N_VIRTUAL_SENSOR_MAX];
    uint64_t last_time_stamp[BHY2_FIFO_TYPE_MAX];
    uint8_t present_buff[32];
};

struct bhy2_fifo_buffer {
    uint32_t read_pos;
    uint32_t read_length;
    uint32_t remain_length;
    uint32_t buffer_size;
    uint8_t *buffer;
};

typedef int16_t (*bhy2_frame_parse_func_t)(struct bhy2_fifo_buffer *p_fifo_buffer, struct bhy2_dev *bhy2_p);

struct bhy2_virt_sensor_conf {
    uint16_t sensitivity;
    uint16_t range;
    uint32_t latency;
    bhy2_float sample_rate;
};

struct bhy2_data_xyz {
    int16_t x;
    int16_t y;
    int16_t z;
};

struct bhy2_data_quaternion {
    int16_t x;
    int16_t y;
    int16_t z;
    int16_t w;
    uint16_t accuracy;
};

struct bhy2_data_orientation {
    int16_t heading;
    int16_t pitch;
    int16_t roll;
};

