waveshareteam/ESP32-S3-Touch-AMOLED-2.16/examples/arduino/libraries/SensorLib/src/bosch/bhy2_defs.h
union BHY2_PACKED bhy2_spt_dev_id {
    uint8_t slave_address;
    uint8_t cs_pin;
};

struct BHY2_PACKED bhy2_spt_bits {
    /*! byte 1 */
    uint8_t direction : 1; /**< 0: read; 1: write. */
    uint8_t trans_type : 1; /**< 0: single burst; 1:multi single transfers. */
    uint8_t delay_ctrl : 1; /**< 0: none; 1: delay between bytes. */
    uint8_t master_bus : 2; /**< 1: SIF1; 2: SIF2; 3:SIF3. */
    uint8_t spi_mode : 1; /**< 0: 4 wire; 1: 3 wire. */
    uint8_t cpol : 1; /**< spi clock polarity. */
    uint8_t cpha : 1; /**< spi clock phase. */
    /*! byte 2 */
    uint8_t delay_val : 6; /**< multiples of 50us. min is 200us (4LSB) */
    uint8_t cs_level : 1; /**< chip select level. */
    uint8_t lsb_first : 1; /**< least significant byte first. */
    /*! byte 3~4 */
    uint16_t trans_rate; /**< spi clock rate. */
    /*! byte 5 */
    uint8_t address_shift : 4; /**< number of bits to shift register address. */
    uint8_t read_bit_pol : 1; /**< 0: active low; 1: active high. */
    uint8_t read_bit_pos : 3; /**< bit number of read bit in command byte. */
    /*! byte 6 */
    union bhy2_spt_dev_id func_set;

    /*! byte 7 */
    uint8_t trans_count;

    /*! byte 8 */
    uint8_t reg;
};

union bhy2_soft_passthrough_conf {
    struct bhy2_spt_bits conf;
    uint8_t data[8];
};

union bhy2_u16_conv {
    uint16_t u16_val;
    uint8_t bytes[2];
};
union bhy2_u32_conv {
    uint32_t u32_val;
    uint8_t bytes[4];
};
union bhy2_float_conv {
    bhy2_float f_val;
    uint32_t u32_val;
    uint8_t bytes[4];
};
struct bhy2_sensor_info {
    uint8_t sensor_type;
    uint8_t driver_id;
    uint8_t driver_version;
    uint8_t power;
    union bhy2_u16_conv max_range;
    union bhy2_u16_conv resolution;
    union bhy2_float_conv max_rate;
    union bhy2_u32_conv fifo_reserved;
    union bhy2_u32_conv fifo_max;
    uint8_t event_size;
    union bhy2_float_conv min_rate;
};

struct bhy2_phys_sensor_info {
    uint8_t sensor_type;
    uint8_t driver_id;
    uint8_t driver_version;
    uint8_t power_current;
    union bhy2_u16_conv curr_range;
    uint8_t flags;
    uint8_t slave_address;
    uint8_t gpio_assignment;
    union bhy2_float_conv curr_rate;
    uint8_t num_axis;
    uint8_t orientation_matrix[5];
    uint8_t reserved;
};

struct bhy2_self_test_resp {
    uint8_t test_status;
    int16_t x_offset, y_offset, z_offset;
};

struct bhy2_foc_resp {
    uint8_t foc_status;
    int16_t x_offset, y_offset, z_offset;
};

struct bhy2_orient_matrix {
    int8_t c[9];
};

enum bhy2_data_inj_mode {
    BHY2_NORMAL_MODE = 0,
    BHY2_REAL_TIME_INJECTION = 1,
    BHY2_STEP_BY_STEP_INJECTION = 2
};

#define BHY2_BYTE_TO_NIBBLE(X)  (((uint8_t)(X)[0] & 0x0F) | (((uint8_t)(X)[1] << 4) & 0xF0))

/* End of CPP Guard */
#ifdef __cplusplus
}
#endif /*__cplusplus */

#endif /* __BHY2_DEFS_H__ */
